DROP DATABASE IF EXISTS `atashopping`;
CREATE DATABASE `atashopping`;
USE `atashopping`;

CREATE TABLE IF NOT EXISTS `admin` (
  `username` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL,
  PRIMARY KEY (`username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE IF NOT EXISTS `bank` (
  `cardname` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL,
  `money` double(20,3) default NULL,
  PRIMARY KEY  (`cardname`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE IF NOT EXISTS `moneylog` (
  `logid` varchar(50) NOT NULL,
  `username` varchar(50) NOT NULL,
  `money` double(15,3) default NULL,
  `time` varchar(50) default NULL,
  PRIMARY KEY  (`logid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE IF NOT EXISTS `product` (
  `pid` varchar(50) NOT NULL,
  `pname` varchar(255) NOT NULL,
  `price` double(15,3) NOT NULL,
  `pcount` int(11) default NULL,
  `imgpath` varchar(255) default NULL,
  PRIMARY KEY  (`pid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE IF NOT EXISTS `user` (
  `username` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL,
  `email` varchar(50) NOT NULL,
  `tel` varchar(50) default NULL,
  `address` varchar(50) default NULL,
  `sex` varchar(20) default NULL,
  `age` int(11) default NULL,
  `regtime` varchar(50) default NULL,
  PRIMARY KEY  (`username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE IF NOT EXISTS `useraccount` (
  `username` varchar(50) NOT NULL,
  `money` double(15,3) default NULL,
  PRIMARY KEY  (`username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE IF NOT EXISTS `userform` (
  `id` int(11) NOT NULL auto_increment,
  `fid` varchar(50) NOT NULL,
  `username` varchar(50) NOT NULL,
  `pname` varchar(50) NOT NULL,
  `proprice` double(15,3) default NULL,
  `count` int(11) default NULL,
  `time` varchar(50) default NULL,
  `summoney` double(15,3) default NULL,
  PRIMARY KEY  (`id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;


INSERT INTO `admin` (`username`, `password`) VALUES ('admin','admin');
COMMIT;

INSERT INTO `bank` (`cardname`, `password`, `money`) VALUES ('admin','admin',999429999);
COMMIT;

INSERT INTO `moneylog` (`logid`, `username`, `money`, `time`) VALUES 
  ('L1201429269734','用户1',10000,'2008年01月27日06时21分09秒 '),
  ('L1201429270484','用户2',10000,'2008年01月27日06时21分10秒 '),
  ('L1201429270656','用户3',10000,'2008年01月27日06时21分10秒 '),
  ('L1201429270796','用户4',10000,'2008年01月27日06时21分10秒 '),
  ('L1201429270937','用户5',10000,'2008年01月27日06时21分10秒 '),
  ('L1201429271062','用户6',10000,'2008年01月27日06时21分11秒 '),
  ('L1201429271187','用户7',10000,'2008年01月27日06时21分11秒 '),
  ('L1201429271328','用户8',10000,'2008年01月27日06时21分11秒 '),
  ('L1201429271453','用户9',10000,'2008年01月27日06时21分11秒 '),
  ('L1201429271562','用户10',10000,'2008年01月27日06时21分11秒 '),
  ('L1201429271703','用户11',10000,'2008年01月27日06时21分11秒 '),
  ('L1201429271812','用户12',10000,'2008年01月27日06时21分11秒 '),
  ('L1201429272015','用户13',10000,'2008年01月27日06时21分12秒 '),
  ('L1201429272140','用户14',10000,'2008年01月27日06时21分12秒 '),
  ('L1201429272265','用户15',10000,'2008年01月27日06时21分12秒 '),
  ('L1201429272375','用户16',10000,'2008年01月27日06时21分12秒 '),
  ('L1201429272515','用户17',10000,'2008年01月27日06时21分12秒 '),
  ('L1201429272640','用户18',10000,'2008年01月27日06时21分12秒 '),
  ('L1201429272765','用户19',10000,'2008年01月27日06时21分12秒 '),
  ('L1201429272906','用户20',10000,'2008年01月27日06时21分12秒 '),
  ('L1201429273046','用户21',10000,'2008年01月27日06时21分13秒 '),
  ('L1201429273156','用户22',10000,'2008年01月27日06时21分13秒 '),
  ('L1201429273281','用户23',10000,'2008年01月27日06时21分13秒 '),
  ('L1201429273406','用户24',10000,'2008年01月27日06时21分13秒 '),
  ('L1201429273531','用户25',10000,'2008年01月27日06时21分13秒 '),
  ('L1201429273640','用户26',10000,'2008年01月27日06时21分13秒 '),
  ('L1201429273765','用户27',10000,'2008年01月27日06时21分13秒 '),
  ('L1201429273890','用户28',10000,'2008年01月27日06时21分13秒 '),
  ('L1201429274078','用户29',10000,'2008年01月27日06时21分14秒 '),
  ('L1201429274203','用户30',10000,'2008年01月27日06时21分14秒 '),
  ('L1201429274296','用户31',10000,'2008年01月27日06时21分14秒 '),
  ('L1201429274421','用户32',10000,'2008年01月27日06时21分14秒 '),
  ('L1201429274531','用户33',10000,'2008年01月27日06时21分14秒 '),
  ('L1201429274640','用户34',10000,'2008年01月27日06时21分14秒 '),
  ('L1201429274765','用户35',10000,'2008年01月27日06时21分14秒 '),
  ('L1201429274875','用户36',10000,'2008年01月27日06时21分14秒 '),
  ('L1201429275031','用户37',10000,'2008年01月27日06时21分15秒 '),
  ('L1201429275140','用户38',10000,'2008年01月27日06时21分15秒 '),
  ('L1201429275281','用户39',10000,'2008年01月27日06时21分15秒 '),
  ('L1201429275406','用户40',10000,'2008年01月27日06时21分15秒 '),
  ('L1201429275500','用户41',10000,'2008年01月27日06时21分15秒 '),
  ('L1201429275609','用户42',10000,'2008年01月27日06时21分15秒 '),
  ('L1201429275718','用户43',10000,'2008年01月27日06时21分15秒 '),
  ('L1201429275859','用户44',10000,'2008年01月27日06时21分15秒 '),
  ('L1201429275984','用户45',10000,'2008年01月27日06时21分15秒 '),
  ('L1201429276125','用户46',10000,'2008年01月27日06时21分16秒 '),
  ('L1201429276234','用户47',10000,'2008年01月27日06时21分16秒 '),
  ('L1201429276343','用户48',10000,'2008年01月27日06时21分16秒 '),
  ('L1201429276453','用户49',10000,'2008年01月27日06时21分16秒 '),
  ('L1201533883093','ataata',20000,'2008年01月28日11时24分43秒 '),
  ('L1201576219578','java123',20000,'2008年01月29日11时10分19秒 '),
  ('L1201577538484','javaek',40000,'2008年01月29日11时32分18秒 ');

COMMIT;

INSERT INTO `product` (`pid`, `pname`, `price`, `pcount`, `imgpath`) VALUES 
  ('P1201540144093','望远镜',123,195,'http://localhost:8080/atashopping1.2/images/pic08b.jpg'),
  ('P1201540170171','MOTOL6',1900,200,'http://localhost:8080/atashopping1.2/images/pic09b.jpg'),
  ('P1201573121015','sony mp3',3000,2311,'http://localhost:8080/atashopping1.2/images/pic50b.jpg'),
  ('P1201573156843','铁三角耳机',1800,50,'http://localhost:8080/atashopping1.2/images/pic49b.jpg'),
  ('P1201573225765','aigo MP3',1500,50,'http://localhost:8080/atashopping1.2/images/pic48b.jpg'),
  ('P1201573257046','HP 笔记本',5500,23,'http://localhost:8080/atashopping1.2/images/pic47b.jpg'),
  ('P1201573308484','SONY TX16',9800,50,'http://localhost:8080/atashopping1.2/images/pic45b.jpg'),
  ('P1201573363671','联想笔记本',7600,1110,'http://localhost:8080/atashopping1.2/images/pic44b.jpg'),
  ('P1201573406609','NEC笔记本',7800,230,'http://localhost:8080/atashopping1.2/images/pic43b.jpg'),
  ('P1201573436734','IBM R52笔记本',7700,55,'http://localhost:8080/atashopping1.2/images/pic42b.jpg'),
  ('P1201573464765','手机链',10,1000,'http://localhost:8080/atashopping1.2/images/pic41b.jpg'),
  ('P1201573492875','爱国者U盘',400,500,'http://localhost:8080/atashopping1.2/images/pic40b.jpg'),
  ('P1201573895484','爱国者UX盘',1234,345,'http://localhost:8080/atashopping1.2/images/pic39b.jpg'),
  ('P1201573922156','sony 耳机',234,341,'http://localhost:8080/atashopping1.2/images/pic38b.jpg'),
  ('P1201573959250','wd80G硬盘',400,25,'http://localhost:8080/atashopping1.2/images/pic37b.jpg'),
  ('P1201573997765','Kingston内存条',400,45,'http://localhost:8080/atashopping1.2/images/pic35b.jpg'),
  ('P1201577704015','闹钟',40,300,'http://localhost:8080/atashopping1.2/images/pic21b.jpg');

COMMIT;

INSERT INTO `user` (`username`, `password`, `email`, `tel`, `address`, `sex`, `age`, `regtime`) VALUES 
  ('ataata','234567','teamochen@126.com','13951652604','无锡100','男',21,'2008年01月28日11时20分59秒 '),
  ('java123','123456','teamochen@126.com','13951652603','无锡','男',21,'2008年01月29日11时08分46秒 '),
  ('javaek','123456','teamochen@126.com','13951652603','无锡ata','男',10,'2008年01月29日11时31分41秒 '),
  ('用户17','123','ata17@126.com','13951652617','无锡太湖大道17号','男',17,'2008年01月27日06时15分57秒'),
  ('用户18','123','ata18@126.com','13951652618','无锡太湖大道18号','女',18,'2008年01月27日06时15分57秒'),
  ('用户28','123','ata28@126.com','13951652628','无锡太湖大道28号','女',28,'2008年01月27日06时15分58秒'),
  ('用户31','123','ata31@126.com','13951652631','无锡太湖大道31号','男',31,'2008年01月27日06时15分58秒'),
  ('用户32','123','ata32@126.com','13951652632','无锡太湖大道32号','女',32,'2008年01月27日06时15分58秒'),
  ('用户37','123','ata37@126.com','13951652637','无锡太湖大道37号','男',37,'2008年01月27日06时15分59秒'),
  ('用户39','123','ata39@126.com','13951652639','无锡太湖大道39号','男',39,'2008年01月27日06时15分59秒'),
  ('用户42','123','ata42@126.com','13951652642','无锡太湖大道42号','女',42,'2008年01月27日06时15分59秒'),
  ('用户43','123','ata43@126.com','13951652643','无锡太湖大道43号','男',43,'2008年01月27日06时15分59秒'),
  ('用户44','123','ata44@126.com','13951652644','无锡太湖大道44号','女',44,'2008年01月27日06时15分59秒'),
  ('用户45','123','ata45@126.com','13951652645','无锡太湖大道45号','男',45,'2008年01月27日06时15分59秒'),
  ('用户5','123','ata5@126.com','1395165265','无锡太湖大道5号','男',5,'2008年01月27日06时15分56秒'),
  ('用户6','123','ata6@126.com','1395165266','无锡太湖大道6号','女',6,'2008年01月27日06时15分56秒'),
  ('用户7','123','ata7@126.com','1395165267','无锡太湖大道7号','男',7,'2008年01月27日06时15分56秒'),
  ('用户8','123','ata8@126.com','1395165268','无锡太湖大道8号','女',8,'2008年01月27日06时15分57秒');

COMMIT;


INSERT INTO `useraccount` (`username`, `money`) VALUES 
  ('ataata',18667),
  ('java123',15698),
  ('javaek',37366),
  ('用户17',10000),
  ('用户18',10000),
  ('用户19',10000),
  ('用户2',10000),
  ('用户20',10000),
  ('用户21',10000),
  ('用户22',10000),
  ('用户23',10000),
  ('用户24',10000),
  ('用户25',10000),
  ('用户26',10000),
  ('用户27',10000),
  ('用户28',10000),
  ('用户29',10000),
  ('用户3',10000),
  ('用户30',10000),
  ('用户31',10000),
  ('用户32',10000),
  ('用户33',10000),
  ('用户34',10000),
  ('用户35',10000),
  ('用户36',10000),
  ('用户37',10000),
  ('用户39',10000),
  ('用户40',10000),
  ('用户41',10000),
  ('用户42',10000),
  ('用户43',10000),
  ('用户44',10000),
  ('用户45',10000),
  ('用户46',10000),
  ('用户47',10000),
  ('用户48',10000),
  ('用户49',10000),
  ('用户5',10000),
  ('用户6',10000),
  ('用户7',10000),
  ('用户8',10000),
  ('用户9',10000);

COMMIT;


INSERT INTO `userform` (`id`, `fid`, `username`, `pname`, `proprice`, `count`, `time`, `summoney`) VALUES 
  (1,'F1201546375203','ataata','手表',50,1,'2008年01月29日02时52分55秒 ',50),
  (2,'F1201546482875','ataata','望远镜',123,1,'2008年01月29日02时54分42秒 ',123),
  (3,'F1201546636015','ataata','望远镜',123,1,'2008年01月29日02时57分16秒 ',123),
  (4,'F1201546790984','ataata','望远镜',123,1,'2008年01月29日02时59分50秒 ',123),
  (5,'F1201546843765','ataata','望远镜',123,1,'2008年01月29日03时00分43秒 ',123),
  (6,'F1201546962312','ataata','手表',50,1,'2008年01月29日03时02分42秒 ',50),
  (7,'F1201547062296','ataata','望远镜',123,1,'2008年01月29日03时04分22秒 ',123),
  (8,'F1201547123718','ataata','手表',50,1,'2008年01月29日03时05分23秒 ',50),
  (9,'F1201568244890','ataata','小车',234,1,'2008年01月29日08时57分24秒 ',234),
  (10,'F1201568285921','ataata','手表',50,1,'2008年01月29日08时58分05秒 ',50),
  (11,'F1201569206796','ataata','小车',234,1,'2008年01月29日09时13分26秒 ',234),
  (12,'F1201569206796','ataata','手表',50,1,'2008年01月29日09时13分26秒 ',50),
  (13,'F1201576249156','java123','Kingston内存条',400,1,'2008年01月29日11时10分49秒 ',400),
  (14,'F1201576249156','java123','wd80G硬盘',400,1,'2008年01月29日11时10分49秒 ',400),
  (15,'F1201576249156','java123','sony 耳机',234,1,'2008年01月29日11时10分49秒 ',234),
  (16,'F1201576506593','java123','Kingston内存条',400,1,'2008年01月29日11时15分06秒 ',400),
  (17,'F1201576506593','java123','wd80G硬盘',400,1,'2008年01月29日11时15分06秒 ',400),
  (18,'F1201576506593','java123','sony 耳机',234,1,'2008年01月29日11时15分06秒 ',234),
  (19,'F1201576506593','java123','Kingston内存条',400,1,'2008年01月29日11时15分06秒 ',400),
  (20,'F1201576540953','java123','Kingston内存条',400,1,'2008年01月29日11时15分40秒 ',400),
  (21,'F1201576540953','java123','wd80G硬盘',400,1,'2008年01月29日11时15分40秒 ',400),
  (22,'F1201576540953','java123','sony 耳机',234,1,'2008年01月29日11时15分40秒 ',234),
  (23,'F1201576540953','java123','Kingston内存条',400,1,'2008年01月29日11时15分40秒 ',400),
  (24,'F1201576540953','java123','Kingston内存条',400,1,'2008年01月29日11时15分40秒 ',400),
  (25,'F1201577593390','javaek','Kingston内存条',400,1,'2008年01月29日11时33分13秒 ',400),
  (26,'F1201577593390','javaek','wd80G硬盘',400,1,'2008年01月29日11时33分13秒 ',400),
  (27,'F1201577593390','javaek','sony 耳机',234,1,'2008年01月29日11时33分13秒 ',234),
  (28,'F1201577593390','javaek','Kingston内存条',400,1,'2008年01月29日11时33分13秒 ',400),
  (29,'F1201577593390','javaek','Kingston内存条',400,1,'2008年01月29日11时33分13秒 ',400),
  (30,'F1201577593390','javaek','wd80G硬盘',400,1,'2008年01月29日11时33分13秒 ',400),
  (31,'F1201577593390','javaek','Kingston内存条',400,1,'2008年01月29日11时33分13秒 ',400);

COMMIT;